; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-30)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 left right ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 ball27 ball28 ball29 ball30 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(gripper left)
(gripper right)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(ball ball27)
(ball ball28)
(ball ball29)
(ball ball30)
(free left)
(free right)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 rooma)
(at ball10 rooma)
(at ball11 rooma)
(at ball12 rooma)
(at ball13 rooma)
(at ball14 rooma)
(at ball15 rooma)
(at ball16 rooma)
(at ball17 rooma)
(at ball18 rooma)
(at ball19 rooma)
(at ball20 rooma)
(at ball21 rooma)
(at ball22 rooma)
(at ball23 rooma)
(at ball24 rooma)
(at ball25 rooma)
(at ball26 rooma)
(at ball27 rooma)
(at ball28 rooma)
(at ball29 rooma)
(at ball30 rooma)
(at-robby rooma)
)
(:goal
(and
(at ball1 room3)
(at ball2 room3)
(at ball3 room3)
(at ball4 room3)
(at ball5 room3)
(at ball6 room3)
(at ball7 room3)
(at ball8 room3)
(at ball9 room3)
(at ball10 room3)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room3)
(at ball20 room3)
(at ball21 room3)
(at ball22 room3)
(at ball23 room3)
(at ball24 room3)
(at ball25 room3)
(at ball26 room3)
(at ball27 room3)
(at ball28 room3)
(at ball29 room3)
(at ball30 room3)
)
)
)

; plan
1. (pick ball9 rooma left)
   deleted: (at ball9 rooma) (free left)
   added: (carry ball9 left)
   goals met: 0 of 30
2. (pick ball8 rooma right)
   deleted: (at ball8 rooma) (free right)
   added: (carry ball8 right)
   goals met: 0 of 30
3. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 0 of 30
4. (drop ball8 room3 right)
   deleted: (carry ball8 right)
   added: (at ball8 room3) (free right)
   goals met: 1 of 30
5. (drop ball9 room3 left)
   deleted: (carry ball9 left)
   added: (at ball9 room3) (free left)
   goals met: 2 of 30
6. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 2 of 30
7. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 2 of 30
8. (pick ball6 rooma right)
   deleted: (at ball6 rooma) (free right)
   added: (carry ball6 right)
   goals met: 2 of 30
9. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 2 of 30
10. (drop ball6 room3 right)
   deleted: (carry ball6 right)
   added: (at ball6 room3) (free right)
   goals met: 3 of 30
11. (drop ball7 room3 left)
   deleted: (carry ball7 left)
   added: (at ball7 room3) (free left)
   goals met: 4 of 30
12. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 4 of 30
13. (pick ball5 rooma left)
   deleted: (at ball5 rooma) (free left)
   added: (carry ball5 left)
   goals met: 4 of 30
14. (pick ball4 rooma right)
   deleted: (at ball4 rooma) (free right)
   added: (carry ball4 right)
   goals met: 4 of 30
15. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 4 of 30
16. (drop ball4 room3 right)
   deleted: (carry ball4 right)
   added: (at ball4 room3) (free right)
   goals met: 5 of 30
17. (drop ball5 room3 left)
   deleted: (carry ball5 left)
   added: (at ball5 room3) (free left)
   goals met: 6 of 30
18. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 6 of 30
19. (pick ball30 rooma left)
   deleted: (at ball30 rooma) (free left)
   added: (carry ball30 left)
   goals met: 6 of 30
20. (pick ball3 rooma right)
   deleted: (at ball3 rooma) (free right)
   added: (carry ball3 right)
   goals met: 6 of 30
21. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 6 of 30
22. (drop ball3 room3 right)
   deleted: (carry ball3 right)
   added: (at ball3 room3) (free right)
   goals met: 7 of 30
23. (drop ball30 room3 left)
   deleted: (carry ball30 left)
   added: (at ball30 room3) (free left)
   goals met: 8 of 30
24. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 8 of 30
25. (pick ball29 rooma left)
   deleted: (at ball29 rooma) (free left)
   added: (carry ball29 left)
   goals met: 8 of 30
26. (pick ball28 rooma right)
   deleted: (at ball28 rooma) (free right)
   added: (carry ball28 right)
   goals met: 8 of 30
27. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 8 of 30
28. (drop ball28 room3 right)
   deleted: (carry ball28 right)
   added: (at ball28 room3) (free right)
   goals met: 9 of 30
29. (drop ball29 room3 left)
   deleted: (carry ball29 left)
   added: (at ball29 room3) (free left)
   goals met: 10 of 30
30. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 10 of 30
31. (pick ball27 rooma left)
   deleted: (at ball27 rooma) (free left)
   added: (carry ball27 left)
   goals met: 10 of 30
32. (pick ball26 rooma right)
   deleted: (at ball26 rooma) (free right)
   added: (carry ball26 right)
   goals met: 10 of 30
33. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 10 of 30
34. (drop ball26 room3 right)
   deleted: (carry ball26 right)
   added: (at ball26 room3) (free right)
   goals met: 11 of 30
35. (drop ball27 room3 left)
   deleted: (carry ball27 left)
   added: (at ball27 room3) (free left)
   goals met: 12 of 30
36. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 12 of 30
37. (pick ball25 rooma left)
   deleted: (at ball25 rooma) (free left)
   added: (carry ball25 left)
   goals met: 12 of 30
38. (pick ball24 rooma right)
   deleted: (at ball24 rooma) (free right)
   added: (carry ball24 right)
   goals met: 12 of 30
39. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 12 of 30
40. (drop ball24 room3 right)
   deleted: (carry ball24 right)
   added: (at ball24 room3) (free right)
   goals met: 13 of 30
41. (drop ball25 room3 left)
   deleted: (carry ball25 left)
   added: (at ball25 room3) (free left)
   goals met: 14 of 30
42. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 14 of 30
43. (pick ball23 rooma left)
   deleted: (at ball23 rooma) (free left)
   added: (carry ball23 left)
   goals met: 14 of 30
44. (pick ball22 rooma right)
   deleted: (at ball22 rooma) (free right)
   added: (carry ball22 right)
   goals met: 14 of 30
45. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 14 of 30
46. (drop ball22 room3 right)
   deleted: (carry ball22 right)
   added: (at ball22 room3) (free right)
   goals met: 15 of 30
47. (drop ball23 room3 left)
   deleted: (carry ball23 left)
   added: (at ball23 room3) (free left)
   goals met: 16 of 30
48. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 16 of 30
49. (pick ball21 rooma left)
   deleted: (at ball21 rooma) (free left)
   added: (carry ball21 left)
   goals met: 16 of 30
50. (pick ball20 rooma right)
   deleted: (at ball20 rooma) (free right)
   added: (carry ball20 right)
   goals met: 16 of 30
51. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 16 of 30
52. (drop ball20 room3 right)
   deleted: (carry ball20 right)
   added: (at ball20 room3) (free right)
   goals met: 17 of 30
53. (drop ball21 room3 left)
   deleted: (carry ball21 left)
   added: (at ball21 room3) (free left)
   goals met: 18 of 30
54. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 18 of 30
55. (pick ball2 rooma left)
   deleted: (at ball2 rooma) (free left)
   added: (carry ball2 left)
   goals met: 18 of 30
56. (pick ball19 rooma right)
   deleted: (at ball19 rooma) (free right)
   added: (carry ball19 right)
   goals met: 18 of 30
57. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 18 of 30
58. (drop ball19 room3 right)
   deleted: (carry ball19 right)
   added: (at ball19 room3) (free right)
   goals met: 19 of 30
59. (drop ball2 room3 left)
   deleted: (carry ball2 left)
   added: (at ball2 room3) (free left)
   goals met: 20 of 30
60. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 20 of 30
61. (pick ball18 rooma left)
   deleted: (at ball18 rooma) (free left)
   added: (carry ball18 left)
   goals met: 20 of 30
62. (pick ball17 rooma right)
   deleted: (at ball17 rooma) (free right)
   added: (carry ball17 right)
   goals met: 20 of 30
63. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 20 of 30
64. (drop ball17 room3 right)
   deleted: (carry ball17 right)
   added: (at ball17 room3) (free right)
   goals met: 21 of 30
65. (drop ball18 room3 left)
   deleted: (carry ball18 left)
   added: (at ball18 room3) (free left)
   goals met: 22 of 30
66. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 22 of 30
67. (pick ball16 rooma left)
   deleted: (at ball16 rooma) (free left)
   added: (carry ball16 left)
   goals met: 22 of 30
68. (pick ball15 rooma right)
   deleted: (at ball15 rooma) (free right)
   added: (carry ball15 right)
   goals met: 22 of 30
69. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 22 of 30
70. (drop ball15 room3 right)
   deleted: (carry ball15 right)
   added: (at ball15 room3) (free right)
   goals met: 23 of 30
71. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 24 of 30
72. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 24 of 30
73. (pick ball14 rooma left)
   deleted: (at ball14 rooma) (free left)
   added: (carry ball14 left)
   goals met: 24 of 30
74. (pick ball13 rooma right)
   deleted: (at ball13 rooma) (free right)
   added: (carry ball13 right)
   goals met: 24 of 30
75. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 24 of 30
76. (drop ball13 room3 right)
   deleted: (carry ball13 right)
   added: (at ball13 room3) (free right)
   goals met: 25 of 30
77. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 26 of 30
78. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 26 of 30
79. (pick ball12 rooma left)
   deleted: (at ball12 rooma) (free left)
   added: (carry ball12 left)
   goals met: 26 of 30
80. (pick ball11 rooma right)
   deleted: (at ball11 rooma) (free right)
   added: (carry ball11 right)
   goals met: 26 of 30
81. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 26 of 30
82. (drop ball11 room3 right)
   deleted: (carry ball11 right)
   added: (at ball11 room3) (free right)
   goals met: 27 of 30
83. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 28 of 30
84. (move room3 rooma)
   deleted: (at-robby room3)
   added: (at-robby rooma)
   goals met: 28 of 30
85. (pick ball10 rooma left)
   deleted: (at ball10 rooma) (free left)
   added: (carry ball10 left)
   goals met: 28 of 30
86. (pick ball1 rooma right)
   deleted: (at ball1 rooma) (free right)
   added: (carry ball1 right)
   goals met: 28 of 30
87. (move rooma room3)
   deleted: (at-robby rooma)
   added: (at-robby room3)
   goals met: 28 of 30
88. (drop ball10 room3 left)
   deleted: (carry ball10 left)
   added: (at ball10 room3) (free left)
   goals met: 29 of 30
89. (drop ball1 room3 right)
   deleted: (carry ball1 right)
   added: (at ball1 room3) (free right)
   goals met: 30 of 30
